In [16]:
import pandas 
import sklearn 
from sklearn import svm 
from sklearn.metrics import mean_absolute_error

In [2]:
data_frame_train = pandas.read_csv('all/train.csv')
data_frame_test = pandas.read_csv('all/test.csv')

In [3]:
rows, col = data_frame_train.shape
tr_rows = int(rows * .80)
val_rows = rows - tr_rows 
train_df = data_frame_train[:tr_rows]
val_df = data_frame_train[tr_rows+1:]
val_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
713,714,0,3,"Larsson, Mr. August Viktor",male,29.0,0,0,7545,9.4833,NaN,S
714,715,0,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S
715,716,0,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.5250,C45,C
717,718,1,2,"Troutt, Miss. Edwina Celia ""Winnie""",female,27.0,0,0,34218,10.5000,E101,S

In [4]:
df_train_ground_truth = train_df['Survived']
df_val_ground_truth = val_df['Survived']

In [5]:
train_df=train_df.drop(['Survived'],axis=1)
train_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
val_df = val_df.drop(['Survived'],axis=1)
val_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
713,714,3,"Larsson, Mr. August Viktor",male,29.0,0,0,7545,9.4833,NaN,S
714,715,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S
715,716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S
716,717,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.5250,C45,C
717,718,2,"Troutt, Miss. Edwina Celia ""Winnie""",female,27.0,0,0,34218,10.5000,E101,S

In [7]:
train_df['Sex'] = train_df['Sex'].map({'female': 1, 'male': 0})
val_df['Sex'] = val_df['Sex'].map({'female':1, 'male':0})

In [8]:
train_df=train_df.drop(['Name'],axis=1)
train_df=train_df.drop(['Cabin'],axis=1)
train_df=train_df.drop(['Embarked'],axis=1)
val_df=val_df.drop(['Name'],axis=1)
val_df=val_df.drop(['Cabin'],axis=1)
val_df=val_df.drop(['Embarked'],axis=1)
val_df.head()

     PassengerId  Pclass  Sex   Age  SibSp  Parch    Ticket      Fare
713          714       3    0  29.0      0      0      7545    9.4833
714          715       2    0  52.0      0      0    250647   13.0000
715          716       3    0  19.0      0      0    348124    7.6500
716          717       1    1  38.0      0      0  PC 17757  227.5250
717          718       2    1  27.0      0      0     34218   10.5000

In [9]:
train_df=train_df.drop(['Ticket'],axis=1)
val_df=val_df.drop(['Ticket'],axis=1)

In [12]:
train_df.fillna(0, inplace=True)
val_df.fillna(0, inplace=True)

In [13]:
clf = svm.SVC()
clf.fit(train_df.values, df_train_ground_truth.values)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape=None, degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False)

In [17]:
y_pred = clf.predict(val_df.values)

In [18]:
mean_absolute_error(df_val_ground_truth.values, y_pred)

0.3539325842696629